# WallArea_Gross

## Description
Returns the average of the gross area of the interior and exterior face of the wall. The gross area ignores holes in the wall.

```pascal
FUNCTION WallArea_Gross(c : CRITERIA) : REAL;
```

```python

def vs.WallArea_Gross(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from VectorWorks12.0
## Category
* Criteria